NetBSDfr/bsddialog/bsddialog.1
.\"
.\" Copyright (c) 2021-2022 Alfonso Sabato Siciliano
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 14, 2021
.Dt BSDDIALOG 1
.Os
.Sh NAME
.Nm bsddialog
.Nd TUI dialogs
.Sh SYNOPSIS
.Nm bsddialog
.Fl -help
.Nm bsddialog
.Fl -version
.Nm bsddialog
.Op Fl Ar -common-opts
.Fl Ar -widget
.Fl Ar text
.Fl Ar rows
.Fl Ar cols
.Op Fl Ar -dialog-opts
.Sh DESCRIPTION
The
.Nm bsddialog
utility build build Text User Interface dialogs and widgets: to display
messages, to get input and to inform about a computation status.
.Ss Common options
.Bl -tag -width indent
.It Fl -ascii-lines
TODO.
.It Fl -backtitle Ar backtitle
TODO.
.It Fl -begin-x Ar x
TODO.
.It Fl -begin-y Ar y
TODO.
.It Fl -cancel-label Ar string
TODO.
.It Fl -clear
TODO.
.It Fl -colors
TODO.
.It Fl -cr-wrap
TODO.
.It Fl -date-format Ar format
TODO.
.It Fl -defaultno
TODO.
.It Fl -default-button Ar label
TODO.
.It Fl -default-no
TODO.
.It Fl -default-item Ar name
TODO.
.It Fl -disable-esc
TODO.
.It Fl -esc-cancelvalue
TODO.
.It Fl -exit-label Ar label
TODO.
.It Fl -extra-button
TODO.
.It Fl -extra-label Ar label
TODO.
.It Fl -generic1-button Ar label
TODO.
.It Fl -generic2-button Ar label
TODO.
.It Fl -help
TODO.
.It Fl -help-button
TODO.
.It Fl -help-label Ar label
TODO.
.It Fl -help-status
TODO.
.It Fl -help-tags
TODO.
.It Fl -hfile Ar filename
TODO.
.It Fl -hline Ar string
TODO.
.It Fl -hmsg Ar string
TODO.
.It Fl -ignore
TODO.
.It Fl -insecure
TODO.
.It Fl -item-depth
TODO.
.It Fl -item-help
TODO.
.It Fl -items-prefix
TODO.
.It Fl -max-input Ar size
TODO.
.It Fl -no-cancel
TODO.
.It Fl -nocancel
TODO.
.It Fl -no-collapse
TODO.
.It Fl -no-items
TODO.
.It Fl -no-label Ar label
TODO.
.It Fl -no-lines
TODO.
.It Fl -no-nl-expand
TODO.
.It Fl -no-ok
TODO.
.It Fl -nook
TODO.
.It Fl -no-shadow
TODO.
.It Fl -no-tags
TODO.
.It Fl -ok-label Ar label
TODO.
.It Fl -output-fd Ar fd
TODO.
.It Fl -output-separator Ar sep
TODO.
.It Fl -print-maxsize
TODO.
.It Fl -print-size
TODO.
.It Fl -print-version
TODO.
.It Fl -quoted
TODO.
.It Fl -separate-output
TODO.
.It Fl -separator Ar sep
TODO.
.It Fl -shadow
TODO.
.It Fl -single-quoted
TODO.
.It Fl -sleep Ar secs
TODO.
.It Fl -stderr
TODO.
.It Fl -stdout
TODO.
.It Fl -tab-len Ar spaces
TODO.
.It Fl -theme Ar blackwhite|bsddialog|dialog
TODO.
.It Fl -time-format Ar format
TODO.
.It Fl -title Ar title
TODO.
.It Fl -trim
TODO.
.It Fl -version
TODO.
.It Fl -yes-label Ar label
TODO.
.El
.Ss Dialogs
The following dialogs are available:
.Bl -tag -width indent
.It Fl -checklist Ar options
TODO.
.It Fl -datebox Ar options
TODO.
.It Fl -form Ar options
TODO.
.It Fl -gauge Ar options
TODO.
.It Fl -infobox Ar options
TODO.
.It Fl -inputbox Ar options
TODO.
.It Fl -menu Ar options
TODO.
.It Fl -mixedform Ar options
TODO.
.It Fl -mixedgauge Ar options
TODO.
.It Fl -msgbox Ar options
TODO.
.It Fl -passwordbox Ar options
TODO.
.It Fl -passwordform Ar options
TODO.
.It Fl -pause Ar options
TODO.
.It Fl -radiolisto Ar options
TODO.
.It Fl -rangebox Ar options
TODO.
.It Fl -textbox Ar options
TODO.
.It Fl -timebox Ar options
TODO.
.It Fl -treeview Ar options
TODO
It Fl .yesnolibxo Ar options
TODO.
.El
.Sh EXIT STATUS
The
.Nm
utility exits -1 or 255, depending by the terminal, on unsuccessful.
Otherwise, depending on the pressed button, key or user input the following
values can be returned:
.Bl -column -compact
.It 0
Ok or Yes button.
.It 1
Cancel or No button.
.It 2
Help button.
.It 3
Extra button.
.It 4
Timeout.
.It 5
ESC key.
.It 6
Generic 1 button.
.It 7
Generic 2 button.
.Ed
.Sh EXAMPLES
Backtitle, title and message Example:
.Dl bsddialog --backtitle INFO --title info --msgbox Message 0 0
.Pp
.Dq Yes-No Question
and theme Example:
.Dl bsddialog --theme blackwhite --yesno Question 10 30
.Pp
Checklist Example:
.Dl bsddialog --checklist Checklist 0 0 3 N1 \&D1 off N2 D2 on N3 D3 off
.Pp
Gauge script:
.Pp
.Bd -literal -offset indent -compact
characters="A B C D E F G"
total=`echo $characters | awk '{print split($0, a)}'`
i=1
for c in $characters
do
	sleep 1
	echo XXX
	echo "$(expr $(expr $i "*" 100) "/" $total)"
	echo "[$i/$total] Input: $c"
	echo XXX
	if [ $i -eq $total ]
	then
		echo EOF
	fi
	i=`expr $i + 1`
done | ./bsddialog --title " gauge " --gauge "Starting..." 10 70
.Ed
.Sh SEE ALSO
.Xr bsddialog 3 .
.Sh HISTORY
The
.Nm bsddialog
utility first appeared in
.Fx 14.0 .
.Sh AUTHORS
.Nm bsddialog
was written by
.An Alfonso Sabato Siciliano Aq Mt alf.siciliano@gmail.com .
.Sh BUGS
.Fn bsddialog_form
does not resize the dialog after a terminal change and does not provides
scrolling for items.