NetBSDfr/bsddialog/bsddialog.1
.\"
.\" Copyright (c) 2021 Alfonso Sabato Siciliano
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 13, 2021
.Dt BSDDIALOG 1
.Os
.Sh NAME
.Nm bsddialog
.Nd Text User Interface Widgets
.Sh SYNOPSIS
.Nm bsddialog
.Op Fl -common-options
.Fl -widget
.Ar text
.Ar height
.Ar weight
.Op Ar widget-options
.Sh DESCRIPTION
The
.Nm
utility builds Text User Interface Widgets.
.Ss Common Options
The following common options are available:
.Bl -tag -width indent
.It Fl -ascii-lines
TODO
.It Fl -aspect Ar <ratio>
TODO
.It Fl -backtitle Ar <backtitle>
TODO
.It Fl -begin Ar <y> Ar <x>
TODO
.It Fl -cancel-label Ar <string>
TODO
.It Fl -clear
TODO
.It Fl -colors
TODO
.It Fl -column-separator Ar <string>
TODO
.It Fl -cr-wrap
TODO
.It Fl -create-rc Ar <file>
TODO
.It Fl -date-format Ar <format>
TODO
.It Fl -defaultno
TODO
.It Fl -default-button Ar <string>
TODO
.It Fl -default-item Ar <string>
TODO
.It Fl -exit-label Ar <string>
TODO
.It Fl -extra-button
TODO
.It Fl -extra-label Ar <string>
TODO
.It Fl -help
TODO
.It Fl -help-button
TODO
.It Fl -help-label Ar <string>
TODO
.It Fl -help-status
TODO
.It Fl -help-tags
TODO
.It Fl -hfile Ar <filename>
TODO
.It Fl -hline Ar <string>
TODO
.It Fl -ignore
TODO
.It Fl -input-fd Ar <fd>
TODO
.It Fl -insecure
TODO
.It Fl -item-help
TODO
.It Fl -keep-tite
TODO
.It Fl -keep-window
TODO
.It Fl -last-key
TODO
.It Fl -max-input Ar <size>
TODO
.It Fl -no-cancel
TODO
.It Fl -nocancel
TODO
.It Fl -no-collapse
TODO
.It Fl -no-items
TODO
.It Fl -no-kill
TODO
.It Fl -no-label Ar <string>
TODO
.It Fl -no-lines
TODO
.It Fl -no-mouse
TODO
.It Fl -no-nl-expand
TODO
.It Fl -no-ok
TODO
.It Fl -nook
TODO
.It Fl -no-shadow
TODO
.It Fl -no-tags
TODO
.It Fl -ok-label Ar <string>
TODO
.It Fl -output-fd Ar <fd>
TODO
.It Fl -separator Ar <string>
TODO
.It Fl -output-separator Ar <string>
TODO
.It Fl -print-maxsize
TODO
.It Fl -print-size
TODO
.It Fl -print-version
TODO
.It Fl -quoted
TODO
.It Fl -scrollbar
TODO
.It Fl -separate-output
TODO
.It Fl -separate-widget Ar <string>
TODO
.It Fl -shadow
TODO
.It Fl -single-quoted
TODO
.It Fl -size-err
TODO
.It Fl -sleep Ar <secs>
TODO
.It Fl -stderr
TODO
.It Fl -stdout
TODO
.It Fl -tab-correct
TODO
.It Fl -tab-len Ar <n>
TODO
.It Fl -time-format Ar <format>
TODO
.It Fl -timeout Ar <secs>
TODO
.It Fl -title Ar <title>
TODO
.It Fl -trace Ar <filename>
TODO
.It Fl -trim
TODO
.It Fl -version
TODO
.It Fl -visit-items
TODO
.It Fl -yes-label Ar <string>
TODO
.El
.Ss Widgets
The following widgets are available:
.Bl -tag -width indent
.It Fl -buildlist Ar <text> Ar <height> Ar <width>
TODO
.It Fl -calendar Ar <text> Ar <height> Ar <width>
TODO
.It Fl -checklist Ar <text> Ar <height> Ar <width>
TODO
.It Fl -dselect Ar <text> Ar <height> Ar <width>
TODO
.It Fl -editbox Ar <text> Ar <height> Ar <width>
TODO
.It Fl -form Ar <text> Ar <height> Ar <width>
TODO
.It Fl -fselect Ar <text> Ar <height> Ar <width>
TODO
.It Fl -gauge Ar <text> Ar <height> Ar <width>
TODO
.It Fl -infobox Ar <text> Ar <height> Ar <width>
TODO
.It Fl -inputbox Ar <text> Ar <height> Ar <width>
TODO
.It Fl -inputmenu Ar <text> Ar <height> Ar <width>
TODO
.It Fl -menu Ar <text> Ar <height> Ar <width>
TODO
.It Fl -mixedform Ar <text> Ar <height> Ar <width>
TODO
.It Fl -mixedgauge Ar <text> Ar <height> Ar <width>
TODO
.It Fl -msgbox Ar <text> Ar <height> Ar <width>
TODO
.It Fl -passwordbox Ar <text> Ar <height> Ar <width>
TODO
.It Fl -passwordform Ar <text> Ar <height> Ar <width>
TODO
.It Fl -pause Ar <text> Ar <height> Ar <width>
TODO
.It Fl -prgbox Ar <text> Ar <height> Ar <width>
TODO
.It Fl -programbox Ar <text> Ar <height> Ar <width>
TODO
.It Fl -progressbox Ar <text> Ar <height> Ar <width>
TODO
.It Fl -radiolist Ar <text> Ar <height> Ar <width>
TODO
.It Fl -rangebox Ar <text> Ar <height> Ar <width>
TODO
.It Fl -tailbox Ar <text> Ar <height> Ar <width>
TODO
.It Fl -tailboxbg Ar <text> Ar <height> Ar <width>
TODO
.It Fl -textbox Ar <text> Ar <height> Ar <width>
TODO
.It Fl -timebox Ar <text> Ar <height> Ar <width>
TODO
.It Fl -treeview Ar <text> Ar <height> Ar <width>
TODO
.It Fl -yesno Ar <text> Ar <height> Ar <width>
TODO
.El
.\" .Sh IMPLEMENTATION NOTES
.\" Not used in OpenBSD.
.\" .Sh ENVIRONMENT
.\" For sections 1, 6, 7, and 8 only.
.\" .Sh FILES
.\" .Sh EXIT STATUS
.\" For sections 1, 6, and 8 only.
.\" maybe .Ex -std
.\" .Sh EXAMPLES
.\" .Sh DIAGNOSTICS
.\" For sections 1, 4, 6, 7, 8, and 9 printf/stderr messages only.
.Sh SEE ALSO
.Xr dialog 1 ,
.Xr bsddialog 3 ,
.Xr dialog 3
.Sh HISTORY
The
.Nm
utility first appeared in
.Fx 14.0 .
.Sh AUTHORS
.Nm
was written by
.An Alfonso Sabato Siciliano
.Aq Mt alf.siciliano@gmail.com .
